app/controllers/snacks_controller.rb

  def index
    response = HTTParty.get('https://api-snacks.nerderylabs.com/v1/snacks/?ApiKey=bd634d7d-d5c9-427c-bc09-00767e231f31')
    response.each do |item|
      snack = Snack.find_by(api_id: item["id"])
      if snack
        snack.update( purchaselocations:  item["purchaseLocations"],
                      purchasecount:      item["purchaseCount"],
                      lastpurchasedate:   item["lastPurchaseDate"])
      else
        Snack.create( api_id:             item["id"],
                      name:               item["name"],
                      optional:           item["optional"],
                      purchaselocations:  item["purchaseLocations"],
                      purchasecount:      item["purchaseCount"],
                      lastpurchasedate:   item["lastPurchaseDate"],)
      end
      # Snack.create(name: item["name"])
    end
    @permanent_snacks = Snack.where(optional: false)
---
SELECT  "snacks".* FROM "snacks" WHERE "snacks"."api_id" = $1 LIMIT $2  [["api_id", 1000], ["LIMIT", 1]]
INSERT INTO "snacks" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Ramen"], ["created_at", 2017-04-25 03:23:34 UTC], ["updated_at", 2017-04-25 03:23:34 UTC]]
SELECT "snacks".* FROM "snacks" WHERE "snacks"."optional" = $1  [["optional", false]]